Introduction_to_Oracle_Cloud_Essentials/001.Getting_Started_with_Oracle_Cloud_Infrastructure/001.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-07 Tue 10:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Section 1: Getting Started with Oracle Cloud Infrastructure</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Section 1: Getting Started with Oracle Cloud Infrastructure</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4121761">Navigation</a></li>
<li><a href="#orgb3f663f">Notes</a>
<ul>
<li><a href="#org12f9986">Section 1.1: Why Oracle Cloud?</a></li>
<li><a href="#orgfa43f7c">Section 1.2: Oracle Cloud Introduction</a>
<ul>
<li><a href="#org8b17b64">Section 1.2.1: Oracle Cloud Infrastructure (OCI)</a></li>
<li><a href="#org54a10bd">Section 1.2.2: Oracle Cloud Applications</a></li>
</ul>
</li>
<li><a href="#org9a10cc7">Section 1.3: Oracle Cloud Infrastructure (OCI) Architecture</a>
<ul>
<li><a href="#orgacf6dfe">Section 1.3.1: Choosing A Region</a></li>
<li><a href="#org11fcbb0">Section 1.3.2: Availability Domains</a></li>
<li><a href="#org6744f5e">Section 1.3.3: Fault Domains</a></li>
</ul>
</li>
<li><a href="#orgea29059">Section 1.4: OCI Console Walkthrough Demo</a></li>
<li><a href="#org1a9a461">Section 1.5: Compute Services</a></li>
<li><a href="#orgd459937">Section 1.6: Demo - Compute</a></li>
</ul>
</li>
<li><a href="#orgea668cd">Keywords</a></li>
<li><a href="#org9e228bc">Questions</a></li>
<li><a href="#org24f12e6">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4121761" class="outline-2">
<h2 id="org4121761">Navigation</h2>
<div class="outline-text-2" id="text-org4121761">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">Introduction to Oracle Cloud Essentials</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Introduction_to_Oracle_Cloud_Essentials">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Section 2: Getting Started with Oracle Cloud Applications</td>
<td class="org-left">&vert; <a href="../002.Getting_Started_with_Oracle_Cloud_Applications/002.Notes.html">html</a> &vert; <a href="../002.Getting_Started_with_Oracle_Cloud_Applications/002.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Introduction_to_Oracle_Cloud_Essentials/002.Getting_Started_with_Oracle_Cloud_Applications">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb3f663f" class="outline-2">
<h2 id="orgb3f663f">Notes</h2>
<div class="outline-text-2" id="text-orgb3f663f">
</div>
<div id="outline-container-org12f9986" class="outline-3">
<h3 id="org12f9986">Section 1.1: Why Oracle Cloud?</h3>
<div class="outline-text-3" id="text-org12f9986">
<ul class="org-ul">
<li>Oracle Cloud is unique because it can offer cloud infrastructure such as storage, compute, networking, etc. and cloud applications such as finanical apps, healthcare apps, retail apps, human captial management app, etc. all in one cloud</li>
<li>They can also bring 3rd party apps</li>
<li>Oracle also has various developer services such as APEX, kubernetes, AI services, and more</li>
<li>Oracle also have "distributed cloud", they can get the services through the public cloud, hybrid cloud (in-prem), or dedicated cloud where the services are running in customer data centers (OCI dedicated region)</li>
<li>Oracle is also investing in multicloud interacting with other cloud providers</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa43f7c" class="outline-3">
<h3 id="orgfa43f7c">Section 1.2: Oracle Cloud Introduction</h3>
<div class="outline-text-3" id="text-orgfa43f7c">
<ul class="org-ul">
<li>Oracle Cloud may have over 100 services, at a high-level, it can be classified into two categories: Oracle Cloud Infrastructure and Oracle Cloud Applications</li>
<li>Oracle Cloud Infrastructure (OCI) are the infrstructure services that are designed to run any type of application (e.g. modern cloud-native application or any other mission critical workload)</li>
<li>The global cloud data center infrastructure is the physical foundation organized into geographic regions that comprise the OCI platform (think of these regions as cities or regions where you want your OCI services to run)</li>
</ul>
</div>

<div id="outline-container-org8b17b64" class="outline-4">
<h4 id="org8b17b64">Section 1.2.1: Oracle Cloud Infrastructure (OCI)</h4>
<div class="outline-text-4" id="text-org8b17b64">
<ul class="org-ul">
<li>The core services of OCI are: compute, storage, and networking</li>
<li>Compute service provides compute capacity with CPUs and memory (RAM &amp; persistent compute storage) often provisioned as virtual machines</li>
<li>Storage provides different service types for securely storing your data</li>
<li>Networking services allow you to manage and scale public or private networks providing many connectivity options for internal or external components</li>
<li>Other services provided by OCI are databases, developer services, containers &amp; functions, application integrations, ML &amp; AI, Data Lakehouse, analytics, and more</li>
<li>There are security services at every layer to meet regulations, compliance and security requirements</li>
<li>This is all for allowing customers to run their applications in the Oracle Cloud Infrastructure</li>
</ul>
</div>
</div>

<div id="outline-container-org54a10bd" class="outline-4">
<h4 id="org54a10bd">Section 1.2.2: Oracle Cloud Applications</h4>
<div class="outline-text-4" id="text-org54a10bd">
<ul class="org-ul">
<li>There are also applications (by Oracle in the cloud) that customers may be able to use and these software are referred to as Software as a Service or SaaS</li>
<li>Some examples include Oracle Fusion Cloud Enterprise Resource Planning (ERP) which is a complete modern enterprise resource-planning suite that provides financials, general ledger, accounts payable and receivables, and more</li>
<li>Other apps are Supply Chain Management, Human Captial Management, Advertising and Customer Experience, Industry Applications (purposely built applications e.g. construction, engineering, etc.)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9a10cc7" class="outline-3">
<h3 id="org9a10cc7">Section 1.3: Oracle Cloud Infrastructure (OCI) Architecture</h3>
<div class="outline-text-3" id="text-org9a10cc7">
<ul class="org-ul">
<li>There are 3 main constructs of the physical architecture of OCI: regions, availability domains, fault domains</li>
<li>A <b>region</b> represents a localized geographic area that is comprised of one or more <b>availability domains</b> (ADs) which are essentially physical data centers located within that region</li>
<li>These availability domains are connected to each other by a low latency, high bandwidth network</li>
<li>The fault domain is a grouping of hardware and infrastructure within each availability domain</li>
<li>Fault domains allow you to distribute your cloud resources such as compute instances to ensure that they are not running on the same physical hardware within a single availability domain, helping to avoid any single point of failure</li>
<li>Why would you want a cloud provider with multiple regions? Well if your application is growing in Europe then you would like to allocate resources in a region in Europe to reduce the latency your application has with your customers</li>
</ul>
</div>

<div id="outline-container-orgacf6dfe" class="outline-4">
<h4 id="orgacf6dfe">Section 1.3.1: Choosing A Region</h4>
<div class="outline-text-4" id="text-orgacf6dfe">
<ol class="org-ol">
<li>You'd like a region closest to your users for lowest latency and highest performance</li>
<li>Data residency and compliance for storing enterprise data meaning many countries have strict data residency requirements (thus another factor to take into account; the laws and rules of storing data in that country / region)</li>
<li>Another factor to keep in mind are OCI service availability as some services are not offered everywhere and new cloud services can be made available based on regional demand, regulatory compliance, resource availability, and other factors</li>
</ol>
</div>
</div>
