Introduction_to_Oracle_Cloud_Essentials/001.Getting_Started_with_Oracle_Cloud_Infrastructure/001.000.Notes.org
*** Section 1.3.2: Availability Domains
    - Although there may be multiple availability domains within a region, each availability domain are still isolated from each other
    - This provides fault tolerance and becomes very unlikely for more than one availability domain to fail at the same time because the physical infrastructure are not shared between availability domains
    - Thus a fail in one availability domain will not impact another availbility domain

*** Section 1.3.3: Fault Domains
    - Fault domains are a grouping of hardware and insfrastructure within an availability domain
    - You control the placement of your infrastructure resources such as VMs or cloud storage to specific fault domains as you're configuring the provisioning of those resources
    - The reason for using separate fault domains is to protect against any unexpected hardware failure or planned outages during maintenance
    - Each availability domain provide 3 fault domains allowing you to distribute resources
    - Fault domains can be thought as logical data centers within an availability domain which AD is itself a physical data center
    - Thus resources placed in different FDs will not share single points of hardware failure
    - In summary, OCI architecture is organized into geographic regions and each region contains one or more data centers (availability domains) and each data center is subdivided further into 3 fault domains, and these fault domains can be thought as logical data centers placing resources in them

** Section 1.4: OCI Console Walkthrough Demo
   - When logging into the OCI console on the top banner towards the right you will see the regions you are subscribed to 
   - The hamburger on the left allow you to navigate OCI services such as compute, storage, networking, etc.
   - *Note*: In the demo, I noticed each OCI service there are specific "sub-services" and got me curious to what those mean (see questions 1-4)
   - In addition to the navigation hamburger, you have a search bar to search for resources, services, documentation, etc. (see question 5)
   - You can also interact with OCI resources programmatically using Cloud Shell (a development tool that allows you to use the terminal to interact with OCI resources)
   - Whenever you click on a OCI service you are brought to a page with various options but all these services (or resources?) will belong to a compartment
   - What is a compartment? Think of it like a logical collection of related resources, so whenever you want to a create a resource (service?) make sure the right compartment is collected

** Section 1.5: Compute Services
   - OCI Compute Services allow you to create and manage compute resources which are also known as compute instances
   - What are compute instances? They are simply *servers*
   - These servers can be used to deploy your applications and workload on these servers
   - The servers are the foundation for many other OCI services as you simply create an instance, access the instance, and use it (e.g. install apps in the server)
   - Computer instances are based on shapes which determine the type of CPU, how much RAM (memory), and persistent storage
   - There are three types of compute instances:
     1. Virtual Machine: A logical server that runs on top of a bare metal server (usually the bare metal server may have other VMs with other Oracle customers) 
     2. Bare Metal: Dedicated physical server (usually used when workloads are performance-intensive, can't run in VM, or some other requirement)
     3. Dedicated VM Host: Runs Virtual Machines on *dedicated* servers (unlike using VMs where it can run on bare metal servers that may be shared by others) thus you get a bare metal server but it is used to create VMs instead
   - Shapes: A template that determines the resources allocated to an instance (CPU & RAM)
   - Fixed shapes: A number of CPUs and RAM and cannot be customized, applies to bare metal machines and some VMs
   - Flexible Shapes: The number of CPUs and RAM can be customized and changed but only applies to VMs
   - Some VMs allow for vertical scaling where you can change the shape to scale up or down (increase or decrease the number of cpu and ram)
   - You can also horizontal scaling or "autoscaling" where you can create more or less VM instances
   - This can be done automatically based on some metric criteria causing an autoscaling event to be triggered and thus increasing or decreasing the number of VMs
   - Another way to automatically do "autoscaling" is by scheduling, you can schedule an autoscaling event to be triggered at a certain time in the day, in the week, month, etc. and thus increasing or decreasing the number of VMs

** Section 1.6: Demo - Compute
   - You can create compute instances and configure them to the shape (cpu and ram) that you need as Oracle have "flex" shapes
   - You can also create compute instances with a public IP address or without one (thus it uses private IP addresses)
   - You can also create compute instances with a SSH key or not so that users will need the key to be able to access the VM instance

