Introduction_to_Oracle_Cloud_Essentials/001.Getting_Started_with_Oracle_Cloud_Infrastructure/001.000.Notes.org
* Keywords
| Term                               | Definition                                                                                                                                                                                                                                                                                                                                                                                                                         |
|------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Public Cloud                       | A public cloud is a computing environment that provides services and resources (in Oracle's case applications too) over the internet from a company (Oracle)                                                                                                                                                                                                                                                                       |
| Hybrid Cloud                       | A hybrid cloud is a computing environemnt that combines computing, storage, services etc. from a company's on-premises infrastructure with a public cloud thus creating a more versatile infrastructure (the services & resources from the on-prem infrastructure can interact with the public cloud)                                                                                                                              |
| Dedicated Cloud                    | A dedicated cloud is a computing environment that are exlusively allocated to a company thus the resources & services are isolated from everyone else, the company has full control over the cloud even if it is still managed by the cloud provider, thus the company has more security and more flexibility to scale up or down as they are managing the cloud and are constrained to the physcical hardware that they choose    |
| MultiCloud                         | Multicloud is a computing strategy where a customer may use services and resouces from multiple cloud providers using the service or resource that they need from that cloud provider and using other services and resources from other cloud providers (these services and resouces may interact with each other and more cloud providers are providing ways to easily integrate other cloud providers into their infrastructure) |
| Oracle Cloud Infrastructure (OCI)  | Oracle Cloud Infrastructure (OCI) are the infrstructure services that are designed to run any type of application (e.g. modern cloud-native application or any other mission critical workload), not only run but build, test, deploy, and manage                                                                                                                                                                                  |
| Oracle Cloud Applications          | Oracle Cloud Applications are applications as a cloud service to help businesses meet their needs (these applications try to be various solutions for businesses and often integrates well with other Oracle applications and services)                                                                                                                                                                                            |
| Region                             | A region is geographic area where a cloud provider has data centers and infrastructure of cloud services (each Oracle region has one or more availability domains)                                                                                                                                                                                                                                                                 |
| Availability Domains               | Think of availability domains as the actual data centers, the region is simply a geographical area but ADs are the data centers and usually each region has multiple availability domains. These availability domains are the data centers within that region and these availability domains are isolated from each other but connect to each other by a low latency high bandwidth network (the infrastructure are not connected to each other providing fault tolerance) |
| Fault Domains                      | The fault domain is a grouping of hardware and infrastructure within each availability domain (this allows to distribute resources and not have a single point of failure). You can think of fault domains as logical data centers, each AD has 3 fault domains providing fault tolerance                                                                                                                                          |
| Compartment                        |                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| Virtual Machine                    |                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| Bare Metal Machine                 |                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| Dedicated VM Host                  |                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| Shapes                             |                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| Vertical Scaling                   |                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| Horizontal Scaling ("Autoscaling") |                                                                                                                                                                                                                                                                                                                                                                                                                                    |

* Questions
  - *Q*: What are Virtual Cloud Networks?
  - *Q*: What is Web Application Acceleration?
  - *Q*: What are Load Balancers in Networks?
  - *Q*: What is DNS?
  - *Q*: What are resources in OCI and what are services in OCI?
  - *Q*: What is a public subnet?
  - *Q*: What is an internet gateway?

* Summary
