Introduction_to_Oracle_Cloud_Essentials/001.Getting_Started_with_Oracle_Cloud_Infrastructure/001.000.Notes.html

<div id="outline-container-orgea668cd" class="outline-2">
<h2 id="orgea668cd">Keywords</h2>
<div class="outline-text-2" id="text-orgea668cd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Public Cloud</td>
<td class="org-left">A public cloud is a computing environment that provides services and resources (in Oracle's case applications too) over the internet from a company (Oracle)</td>
</tr>

<tr>
<td class="org-left">Hybrid Cloud</td>
<td class="org-left">A hybrid cloud is a computing environemnt that combines computing, storage, services etc. from a company's on-premises infrastructure with a public cloud thus creating a more versatile infrastructure (the services &amp; resources from the on-prem infrastructure can interact with the public cloud)</td>
</tr>

<tr>
<td class="org-left">Dedicated Cloud</td>
<td class="org-left">A dedicated cloud is a computing environment that are exlusively allocated to a company thus the resources &amp; services are isolated from everyone else, the company has full control over the cloud even if it is still managed by the cloud provider, thus the company has more security and more flexibility to scale up or down as they are managing the cloud and are constrained to the physcical hardware that they choose</td>
</tr>

<tr>
<td class="org-left">MultiCloud</td>
<td class="org-left">Multicloud is a computing strategy where a customer may use services and resouces from multiple cloud providers using the service or resource that they need from that cloud provider and using other services and resources from other cloud providers (these services and resouces may interact with each other and more cloud providers are providing ways to easily integrate other cloud providers into their infrastructure)</td>
</tr>

<tr>
<td class="org-left">Oracle Cloud Infrastructure (OCI)</td>
<td class="org-left">Oracle Cloud Infrastructure (OCI) are the infrstructure services that are designed to run any type of application (e.g. modern cloud-native application or any other mission critical workload), not only run but build, test, deploy, and manage</td>
</tr>

<tr>
<td class="org-left">Oracle Cloud Applications</td>
<td class="org-left">Oracle Cloud Applications are applications as a cloud service to help businesses meet their needs (these applications try to be various solutions for businesses and often integrates well with other Oracle applications and services)</td>
</tr>

<tr>
<td class="org-left">Region</td>
<td class="org-left">A region is geographic area where a cloud provider has data centers and infrastructure of cloud services (each Oracle region has one or more availability domains)</td>
</tr>

<tr>
<td class="org-left">Availability Domains</td>
<td class="org-left">Think of availability domains as the actual data centers, the region is simply a geographical area but ADs are the data centers and usually each region has multiple availability domains. These availability domains are the data centers within that region and these availability domains are isolated from each other but connect to each other by a low latency high bandwidth network (the infrastructure are not connected to each other providing fault tolerance)</td>
</tr>

<tr>
<td class="org-left">Fault Domains</td>
<td class="org-left">The fault domain is a grouping of hardware and infrastructure within each availability domain (this allows to distribute resources and not have a single point of failure). You can think of fault domains as logical data centers, each AD has 3 fault domains providing fault tolerance</td>
</tr>

<tr>
<td class="org-left">Compartment</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Virtual Machine</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bare Metal Machine</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Dedicated VM Host</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Shapes</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Vertical Scaling</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Horizontal Scaling ("Autoscaling")</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9e228bc" class="outline-2">
<h2 id="org9e228bc">Questions</h2>
<div class="outline-text-2" id="text-org9e228bc">
<ul class="org-ul">
<li><b>Q</b>: What are Virtual Cloud Networks?</li>
<li><b>Q</b>: What is Web Application Acceleration?</li>
<li><b>Q</b>: What are Load Balancers in Networks?</li>
<li><b>Q</b>: What is DNS?</li>
<li><b>Q</b>: What are resources in OCI and what are services in OCI?</li>
<li><b>Q</b>: What is a public subnet?</li>
<li><b>Q</b>: What is an internet gateway?</li>
</ul>
</div>
</div>

<div id="outline-container-org24f12e6" class="outline-2">
<h2 id="org24f12e6">Summary</h2>
</div>
</div>
</body>
</html>
